DataProcessors/Renault_АРМ_ContactCenter.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_АРМ_ContactCenter</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Renault_Трафик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_Трафик</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипАктивности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ТипыАктивностиТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Закрытый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_РабочийЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Администратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПервичныйПовторный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ПервичныйПовторный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресПочтовогоЯщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BIR</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДляПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДляЛидов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованойДляСервиса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_ШаблоныОтветов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ШаблоныОтветов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШаблонЗаголовка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/Renault_АРМ_ContactCenter/Forms/ФормаОтвета/Ext/Form/Module.bsl
&НаСервере
Процедура УстановитьТекстОтвет ()
	
	Ответ_Док.УстановитьHTML(Renault_ОнлайнКонсультант.ПолучитьHTMLИзТекста(Лид_Ответ), Новый Структура());
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Лид_Ответ") Тогда
		Лид_Ответ = Параметры.Лид_Ответ;
		УстановитьТекстОтвет();
	КонецЕсли;
	Если Параметры.Свойство("Лид_ТекущийЛид") Тогда
		Лид_ТекущийЛид = Параметры.Лид_ТекущийЛид;
		Если ЗначениеЗаполнено(Лид_ТекущийЛид.ДилерскийЦентр) Тогда
			ЯщикОтправки = Справочники.Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере.ПолучитьОсновнойЯщикДляЛидов(Лид_ТекущийЛид.ДилерскийЦентр.BIR);
		КонецЕсли;
	КонецЕсли;
	Если Параметры.Свойство("ИДТрафика") Тогда
		ИДТрафика = Параметры.ИДТрафика;
		ЗаписьТрафик = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ИДТрафика);
		Если ЗаписьТрафик.ТипТрафика = Справочники.CRM_ТипТрафика.Email Тогда
			Если ЗначениеЗаполнено(ЗаписьТрафик.ДилерскийЦентр) Тогда
				ЯщикОтправки = Справочники.Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере.ПолучитьОсновнойЯщикДляПочты(ЗаписьТрафик.ДилерскийЦентр.BIR);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Клиент_Email") Тогда
		Клиент_Email = Параметры.Клиент_Email;
	КонецЕсли;
	
	//Лид_СписокBIR = Новый СписокЗначений;	
	//Лид_СписокBIR.ЗагрузитьЗначения(КонтактЦентрСервер.ПолучитьМассивBIRLMTПользователя(ПараметрыСеанса.ТекущийПользователь));
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВложениеEmail(Команда)
	
	Адрес = "";
	ВыбранныйФайл = "";
	ОбработчикОповещенияОЗакрытии = Новый ОписаниеОповещения("ПомещениеФайлаПриОкончании", ЭтаФорма);
	НачатьПомещениеФайла(ОбработчикОповещенияОЗакрытии, Адрес, ВыбранныйФайл, Истина, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ПомещениеФайлаПриОкончании(РезультатПомещения, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт

	Если РезультатПомещения = Ложь Тогда
		Элементы.НадписьВложения.Заголовок = "";
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Вложения.Добавить();
	НоваяСтрока.Расположение = 4;
	НоваяСтрока.ИмяФайлаНаКомпьютере = Адрес;
	НоваяСтрока.ИмяФайла = ВыбранноеИмяФайла;
	
	Расширение = DMS_ПолучитьРасширениеФайла(ВыбранноеИмяФайла);
	НоваяСтрока.ИндексКартинки = ПолучитьИндексПиктограммыФайла(Расширение);
	ИмяКаталога = "";
	ИмяФайла = "";
	ПолучитьКаталогИИмяФайла(ВыбранноеИмяФайла, ИмяКаталога, ИмяФайла);
	НоваяСтрока.Наименование = ИмяФайла;
	
	Если Вложения.Количество() > 0 Тогда
		ЗаголовокВложения = "Вложения: ";
		Для Каждого СтрокаВложения из Вложения Цикл 
			ЗаголовокВложения = ЗаголовокВложения + СтрокаВложения.Наименование +"; ";
		КонецЦикла;
		Элементы.НадписьВложения.Заголовок = ЗаголовокВложения;
		Элементы.НадписьВложения.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтветНаЛидПоШаблону(Команда)
	
	////Выберем шаблон
	//ПараметрыОповещения = Новый Структура();
	////ПараметрыОповещения.Вставить("МассивBIR", Лид_СписокBIR.ВыгрузитьЗначения());
	//ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораШаблона", ЭтаФорма, ПараметрыОповещения);
	//
	//ОткрытьФорму("Справочник.Renault_ШаблоныОтветов.ФормаВыбора",,ЭтаФорма,,,,
	//	ОписаниеОповещения,
	//	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	Значение = Справочники.Renault_ШаблоныОтветов.ПолучитьФормуВыбора().ОткрытьМодально();
	Если ЗначениеЗаполнено(Значение) Тогда 
		ЗаполнитьФормуПоШаблону(Значение);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораШаблона(Значение, Параметры) Экспорт
	
	Если Значение <> Неопределено Тогда
		ЗаполнитьФормуПоШаблону(Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуПоШаблону(ШаблонСсылка)
	
	ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
	Лид_ЗаголовокОтвета = ШаблонОбъект.ШаблонЗаголовка;
	Лид_Ответ = ШаблонОбъект.ШаблонОтвета;
	
	//ВыполнитьЗаменуТеговШаблона(Лид_ЗаголовокОтвета);
	//ВыполнитьЗаменуТеговШаблона(Лид_Ответ);
	УстановитьТекстОтвет();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаменуТеговШаблона(Текст)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТегиДляАвтоЗамены.Тег,
	               |	ТегиДляАвтоЗамены.Реквизит
	               |ИЗ
	               |	Справочник.ТегиДляАвтоЗамены КАК ТегиДляАвтоЗамены
	               |ГДЕ
	               |	ТегиДляАвтоЗамены.Активен
	               |	И (ВЫБОР
	               |				КОГДА &BIRУстановлен
	               |					ТОГДА ТегиДляАвтоЗамены.BIR = &BIR
	               |				ИНАЧЕ ЛОЖЬ
	               |			КОНЕЦ
	               |			ИЛИ ТегиДляАвтоЗамены.Общий)";
	BIRПользователя = РегистрыСведений.НастройкиПользователей.ПолучитьЗначениеНастройки("BIR");
	Если BIRПользователя = Ложь Тогда
		Запрос.УстановитьПараметр("BIRУстановлен", Ложь);
	Иначе 
		Запрос.УстановитьПараметр("BIRУстановлен", Истина);
	КонецЕсли;   
	Запрос.УстановитьПараметр("BIR", BIRПользователя);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл           
		Выполнить(Выборка.Реквизит);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена_Закрыть(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтветНаЛидEmail(Команда)
	
	Ответ_Док.ПолучитьHTML(Лид_Ответ, Новый Структура()); 
	НачалоСтиля = Найти(Лид_Ответ, "<style");
	КонецСтиля = Найти(Лид_Ответ, "</style") +8;
	ЧислоСимволов = КонецСтиля - НачалоСтиля;
	СтрСтиля = Сред(Лид_Ответ, НачалоСтиля, ЧислоСимволов);
	Лид_Ответ = СтрЗаменить(Лид_Ответ, СтрСтиля, "");
	Если Не ЗначениеЗаполнено(СокрЛП(Лид_Ответ)) Тогда
		ПоказатьПредупреждение(, "Сообщение обязательно для заполнения");
		Возврат;
	КонецЕсли;
	Ответ = ОтправитьОтветНаЛидНаСервере();
	Если Ответ = "0" ИЛИ Ответ = Истина Тогда 
		сОтвет = Новый Структура;
		сОтвет.Вставить("Результат", Истина);
		сОтвет.Вставить("Лид_Ответ", Лид_Ответ);
		сОтвет.Вставить("Заголовок", Лид_ЗаголовокОтвета);
		Закрыть(сОтвет);
	Иначе
		Если Ответ = "1" Тогда
			ПоказатьПредупреждение(, "Отсутствует настройка почтового сервера, обратитесь в службу поддержки");
		ИначеЕсли Ответ = "2" Тогда
			ПоказатьПредупреждение(, "Невозможно установить соединение с почтовым сервером, обратитесь в службу поддержки");
		ИначеЕсли Ответ = "3" Тогда
			ПоказатьПредупреждение(, "Адрес e-mail не корректен, отправка сообщения невозможна");
		ИначеЕсли Ответ = "4" Тогда
			ПоказатьПредупреждение(, "Невозможно установить соединение с сервером отправки почты, обратитесь в службу поддержки");
		ИначеЕсли Ответ = "6" Тогда
			ПоказатьПредупреждение(, "В тексте письма содержатся изображения. Удалите их, и повторите отправку");
		Иначе
			ПоказатьПредупреждение(, "Отправка сообщения не удалась, обратитесь в службу поддержки");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОтправитьОтветНаЛидНаСервере()
	
	////В зависимости от типа трафика будет выбрана учетная запись электронной почты в гейте
	//ТипТрафика = Строка(Лид_ТекущийЛид.Вид);
	//ТаблицаРезультат = Новый ТаблицаЗначений;
	//ТаблицаРезультат.Колонки.Добавить("ТипТрафика");
	//НоваяСтрока = ТаблицаРезультат.Добавить();
	//НоваяСтрока.ТипТрафика = ТипТрафика;	
	////Сериализатор = Новый СериализаторXDTO(СервисФабрика);
	////ПараметрыСоединения = Сериализатор.ЗаписатьXDTO(ТаблицаРезультат);
	ЭтоПочтовоеСообщение = Ложь;
	НаборТр = РегистрыСведений.Renault_Трафик.СоздатьНаборЗаписей();
	НаборТр.Отбор.Идентификатор.Установить(ИДТрафика);
	НаборТр.Прочитать();
	АдресКлиента = "";
	Если НаборТр.Количество() <> 0 Тогда
		Запись = НаборТр[0];
		Если Запись.ТипТрафика = Справочники.CRM_ТипТрафика.Email Тогда
			ЭтоПочтовоеСообщение = Истина;
			Клиент = Запись.Клиент;
			АдресКлиента = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Запись.Клиент);
		Конецесли;
	КонецЕсли;
	
	//Подготовим вложения, если есть
	ТаблицаВложений = Новый ТаблицаЗначений;
	ТаблицаВложений.Колонки.Добавить("Данные");
	ТаблицаВложений.Колонки.Добавить("Расширение");
	Для Каждого Вложение ИЗ Вложения Цикл
		Расширение = DMS_ПолучитьРасширениеФайла(Вложение.ИмяФайла);
		Данные = ПолучитьИзВременногоХранилища(Вложение.ИмяФайлаНаКомпьютере);
		НоваяСтрокаВложения = ТаблицаВложений.Добавить();
		НоваяСтрокаВложения.Данные = Данные;
		НоваяСтрокаВложения.Расширение = Расширение;
	КонецЦикла;
	
	//Подготовим данные для отправки
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Тема");
	Результат.Колонки.Добавить("ТекстHTML");
	Результат.Колонки.Добавить("Получатель");
	Результат.Колонки.Добавить("Вложение");
	НоваяСтрока = Результат.Добавить();
	НоваяСтрока.Тема = СокрЛП(Лид_ЗаголовокОтвета + " /#" + Лид_ТекущийЛид.НомерЛида);
	НоваяСтрока.ТекстHTML = Лид_Ответ;
	Если НЕ ЭтоПочтовоеСообщение Тогда
		АдресКлиента = Лид_ТекущийЛид.КлиентАдресЭлектроннойПочты;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Клиент_Email) Тогда
		АдресКлиента = Клиент_Email;
	КонецЕсли;
	
	НоваяСтрока.Получатель = АдресКлиента;
	НоваяСтрока.Вложение = ТаблицаВложений;	
	//ПараметрыПисьма = Сериализатор.ЗаписатьXDTO(Результат);
	
	//ИдентификаторДилера =Лид_ТекущийЛид.BIR;
	
	ТемаПисьма = СокрЛП(Лид_ЗаголовокОтвета + " /#" + ПреобразоватьЧислоВСтроку(Лид_ТекущийЛид.НомерЛида)); //DMSCOR-757
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("НомерЛида", Лид_ТекущийЛид.НомерЛида);
	ДопПараметры.Вставить("Сотрудник", Строка(ПараметрыСеанса.Пользователь.Сотрудник));
	ДопПараметры.Вставить("BIR_LMT", Лид_ТекущийЛид.ДилерскийЦентр.Бир_ЛМТ);
	
	ОтветСервиса = Renault_ОнлайнКонсультант.ОтправитьОтветНаЛидВебСервис(Лид_Ответ, ИДТрафика, АдресКлиента, ТемаПисьма, ТаблицаВложений, ДопПараметры, ЯщикОтправки.АдресПочтовогоЯщика);
	
	Возврат ОтветСервиса;
	//Если ОтправкаУспешна Тогда
	//	Возврат "0";
	//КонецЕсли;
	
КонецФункции

// Получает расширение для переданного имени файла.
//
// Параметры
//  ИмяФайла  - Строка - имя файла, для которого необходимо получить расширение.
//
// Возвращаемое значение:
//   Строка   - расширение, полученное из переданного имени файла.
//
//Функция ПолучитьРасширениеФайла(Знач ИмяФайла)
//	
//	Файл = Новый Файл(ИмяФайла);
//	РасширениеФайла = ?(ПустаяСтрока(Файл.Расширение), Файл.Расширение, Прав(Файл.Расширение, СтрДлина(Файл.Расширение)-1));
//	
//	Возврат РасширениеФайла;
//	
//КонецФункции

// Получается индекс пиктограммы файла - индекс в картинке КоллекцияПиктограммФайлов
//Функция ПолучитьИндексПиктограммыФайла(Знач РасширениеФайла)
//	
//	Если ТипЗнч(РасширениеФайла) <> Тип("Строка")
//	 ИЛИ ПустаяСтрока(РасширениеФайла) Тогда
//		
//		Возврат 0;
//	КонецЕсли;
//	
//	РасширениеФайла = Renault_ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(РасширениеФайла);
//	
//	Расширение = "." + НРег(РасширениеФайла) + ";";
//	
//	Если Найти(".dt;.1cd;.cf;.cfu;", Расширение) <> 0 Тогда
//		Возврат 6; //Файлы 1С.
//		
//	ИначеЕсли Расширение = ".mxl;" Тогда
//		Возврат 8; //Табличный Файл.
//		
//	ИначеЕсли Найти(".txt;.log;.ini;", Расширение) <> 0 Тогда
//		Возврат 10; // Текстовый Файл.
//		
//	ИначеЕсли Расширение = ".epf;" Тогда
//		Возврат 12; //Внешние обработки.
//		
//	ИначеЕсли Найти(".ico;.wmf;.emf;",Расширение) <> 0 Тогда
//		Возврат 14; // Картинки.
//		
//	ИначеЕсли Найти(".htm;.html;.url;.mht;.mhtml;",Расширение) <> 0 Тогда
//		Возврат 16; // HTML.
//		
//	ИначеЕсли Найти(".doc;.dot;.rtf;",Расширение) <> 0 Тогда
//		Возврат 18; // Файл Microsoft Word.
//		
//	ИначеЕсли Найти(".xls;.xlw;",Расширение) <> 0 Тогда
//		Возврат 20; // Файл Microsoft Excel.
//		
//	ИначеЕсли Найти(".ppt;.pps;",Расширение) <> 0 Тогда
//		Возврат 22; // Файл Microsoft PowerPoint.
//		
//	ИначеЕсли Найти(".vsd;",Расширение) <> 0 Тогда
//		Возврат 24; // Файл Microsoft Visio.
//		
//	ИначеЕсли Найти(".mpp;",Расширение) <> 0 Тогда
//		Возврат 26; // Файл Microsoft Visio.
//		
//	ИначеЕсли Найти(".mdb;.adp;.mda;.mde;.ade;",Расширение) <> 0 Тогда
//		Возврат 28; // База данных Microsoft Access.
//		
//	ИначеЕсли Найти(".xml;",Расширение) <> 0 Тогда
//		Возврат 30; // xml.
//		
//	ИначеЕсли Найти(".msg;",Расширение) <> 0 Тогда
//		Возврат 32; // Письмо электронной почты.
//		
//	ИначеЕсли Найти(".zip;.rar;.arj;.cab;.lzh;.ace;",Расширение) <> 0 Тогда
//		Возврат 34; // Архивы.
//		
//	ИначеЕсли Найти(".exe;.com;.bat;.cmd;",Расширение) <> 0 Тогда
//		Возврат 36; // Исполняемые файлы.
//		
//	ИначеЕсли Найти(".grs;",Расширение) <> 0 Тогда
//		Возврат 38; // Графическая схема.
//		
//	ИначеЕсли Найти(".geo;",Расширение) <> 0 Тогда
//		Возврат 40; // Географическая схема.
//		
//	ИначеЕсли Найти(".jpg;.jpeg;.jp2;.jpe;",Расширение) <> 0 Тогда
//		Возврат 42; // jpg.
//		
//	ИначеЕсли Найти(".bmp;.dib;",Расширение) <> 0 Тогда
//		Возврат 44; // bmp.
//		
//	ИначеЕсли Найти(".tif;.tiff;",Расширение) <> 0 Тогда
//		Возврат 46; // tif.
//		
//	ИначеЕсли Найти(".gif;",Расширение) <> 0 Тогда
//		Возврат 48; // gif.
//		
//	ИначеЕсли Найти(".png;",Расширение) <> 0 Тогда
//		Возврат 50; // png.
//		
//	ИначеЕсли Найти(".pdf;",Расширение) <> 0 Тогда
//		Возврат 52; // pdf.
//		
//	ИначеЕсли Найти(".odt;",Расширение) <> 0 Тогда
//		Возврат 54; // Open Office writer.
//		
//	ИначеЕсли Найти(".odf;",Расширение) <> 0 Тогда
//		Возврат 56; // Open Office math.
//		
//	ИначеЕсли Найти(".odp;",Расширение) <> 0 Тогда
//		Возврат 58; // Open Office Impress.
//		
//	ИначеЕсли Найти(".odg;",Расширение) <> 0 Тогда
//		Возврат 60; // Open Office draw.
//		
//	ИначеЕсли Найти(".ods;",Расширение) <> 0 Тогда
//		Возврат 62; // Open Office calc.
//		
//	ИначеЕсли Найти(".mp3;",Расширение) <> 0 Тогда
//		Возврат 64;
//		
//	ИначеЕсли Найти(".erf;",Расширение) <> 0 Тогда
//		Возврат 66; // Внешние отчеты.
//		
//	ИначеЕсли Найти(".docx;",Расширение) <> 0 Тогда
//		Возврат 68; // Файл Microsoft Word docx.
//		
//	ИначеЕсли Найти(".xlsx;",Расширение) <> 0 Тогда
//		Возврат 70; // Файл Microsoft Excel xlsx.
//		
//	ИначеЕсли Найти(".pptx;",Расширение) <> 0 Тогда
//		Возврат 72; // Файл Microsoft PowerPoint pptx.
//		
//	ИначеЕсли Найти(".p7s;",Расширение) <> 0 Тогда
//		Возврат 74; // Файл подписи.
//		
//	ИначеЕсли Найти(".p7m;",Расширение) <> 0 Тогда
//		Возврат 76; // зашифрованное сообщение.
//	Иначе
//		Возврат 4;
//	КонецЕсли;
//	
//КонецФункции

// Получает каталог и имя файла для переданного полного имени файла.
//
// Параметры
//  ПолноеИмяФайла  - Строка - полное имя файла, из которого будут получены имя каталога и имя файла.
//  ИмяКаталога     - Строка - в данную переменную будет помещено полученное имя каталога.
//  ИмяФайла        - Строка - в данную переменную будет помещено полученное имя файла.
//
Процедура ПолучитьКаталогИИмяФайла(Знач ПолноеИмяФайла, ИмяКаталога, ИмяФайла) Экспорт
	
	ИмяФайла = ПолноеИмяФайла;
	ИмяКаталога = "";
	
	Пока Истина Цикл
		
		Позиция = Макс(Найти(ИмяФайла, "\"), Найти(ИмяФайла, "/"));
		Если Позиция = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ИмяКаталога = ИмяКаталога + Лев(ИмяФайла, Позиция);
		ИмяФайла = Сред(ИмяФайла, Позиция+1);
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьВложения(Команда)
	
	Вложения.Очистить();
	Элементы.НадписьВложения.Заголовок = "";
	
КонецПроцедуры

&НаСервере
Функция ПреобразоватьЧислоВСтроку(НомерЛида)
	
	НомерЛидаСтрока = Строка(НомерЛида);
	НомерЛидаСтрока = СтрЗаменить(НомерЛидаСтрока, " ", "");
	НомерЛидаСтрока = СтрЗаменить(НомерЛидаСтрока, Символы.НПП, "");
	
	Возврат НомерЛидаСтрока;
	
КонецФункции
